[
    {
        "id": 1,
        "category": "car",
        "title": "THE ALL NEW MAZDA 6E ELECTRIC BEING RELEASED ON 2026",
        "image": "images/mazda_6.jpg",
        "description": "Mazda have officially brought back  mazda 6 after its discontuation in 2020. They brought back the mazda 6 all new with new  features and new design diffrent from the previous model 6.The good news is that they brought the car back in an electric mode and a rear wheel drive from the previous one which were diesel/petrol & front wheel drive.\nEXTERIOR FEATURES\nMazda now made the 6e bigger size than the other rivals at 49meters long as a electric car is more appealing on a far distance. The price range differ from continent to continent.\nThe grill lights up when o the ignition is on.and the lights run to below the head beam lights,with nice advanced headlights.Also the grill has the mimicking of a real grill for air intake but is not pared with a mazda logo.opening the bonnet/hood has a space not enough like the boot/trunk but can handle some lagguage if the boot/ trunk is full.\nSide view has the nice shape from the front to the back with nice door handles that popes out sideways when you press unlock button on the key fob.With some new feature that the doors are frameless which is diffrent from the old model.with nice 19 inch alloys rims and plastic under the door to protect your paint from getting a scratch when on light offroad.\nBack view spoiler pops up when  its 90km/hr and goes down when in a 50km/hr. which is ideal on racing mode or sports mode. The back lights go all the way  from one end to the other end, it looks a coupe,sedan and a hatchback on a view.when the boot/trunk  is open has enough space from the back seat which can handle 466 liters bigger than rivals and even lot of spacewhen the backs seats are folded.\n\nSPECS\nThe standard range model of the mazda 6e 258 horse power motor rarewheel drive RWD producing 68.9kwh lffp battery power with a range 299 miles range.\n\nThe long range model of the mazda 6e has 345 miles range with 80kwh li-ion battery.\n\nINTERIOR FEATURES\nThe interior of mazda 6e has advanced with the front steerwheel buttons being organised with seat ventilation for only front seats.good headroom and legroom for front passangers.Sunroof but has to be accesed ffrom the infotainment system to open the panaromic sunroof.the steerwheel has manual controls on it.And the middle mirror being framelless.\nThe middle console have buttons on the side for both sides that can be used to open the storage compactment in the middle to place your staff like phone and other things.Ambium lighting on the console width double space for two phones.Underneath the center console is a space with charging ports.\nThe airvents can be controled manually  with few buttons and this time round all the buttons have been moved to the screen.\nThe Drive,Reverse,Neutral and park have been moved from the center console to the side of the steerwheel.\nMazda this time did not play with the infortaiment system with a good screen which is big fast when touched not like the previous generation which was slow on touch and small in size.with abit of uniqueness using hand gestures to turn radio volume up and down with nice sound system from sony.Also a back clear camera on the back \nBack seats have nice head room with enough leg room for adults with cup holders for two with the hand rest down and when up can fit another person in the middle.Panoramic sunroof for backseat passangers and nice control for the passangers at the back to control there sunroof and push the front seat if the space is not enough at the back.Not fogeting comes with blinds at the back and isofits for babys showing its a family car. \nDRIVING DYNAMIC\nThe car drives smooth with good suspension. the steerwheel holds well when driving when the car is on sport mode it becomes fast producing good power from the battery and still rides smooth on sport mode and the car has good signal when a driver changes lane without checking will alert the driver to check or not remove eyes from the road.\n",
        "likes": 0
    }
]